# Membalik Urutan Baris dan Kolom

### Import Modul dan Cek Versi

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

### Persiapan Data Frame

In [2]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')
df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)),
                  columns=cols)
df

   A  B  C  D  E
0  5  8  2  4  7
1  9  6  5  7  9
2  3  7  3  7  2
3  8  3  1  3  1
4  4  1  6  2  3

# Membalik Urutan Kolom

In [4]:
df.loc[:,::-1]

   E  D  C  B  A
0  7  4  2  8  5
1  9  7  5  6  9
2  2  7  3  7  3
3  1  3  1  3  8
4  3  2  6  1  4

# Membalik Urutan Baris

In [5]:
df.loc[::-1]

   A  B  C  D  E
4  4  1  6  2  3
3  8  3  1  3  1
2  3  7  3  7  2
1  9  6  5  7  9
0  5  8  2  4  7

# Membalik urutan baris dan penyesuaian ulang index

In [6]:
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  4  1  6  2  3
1  8  3  1  3  1
2  3  7  3  7  2
3  9  6  5  7  9
4  5  8  2  4  7